<template>
  <div class="container">
    <img class="picture" src="images/about/about_picture.jpg" alt="">
    <div class="text-content">
      <h1>Информация обо мне</h1>
      <p v-html="text"></p>
      <hr>
      <p>{{ edu }}</p>
      <p>Преподаваемые дисциплины:</p>
      <ul>
        <li
          v-for="(item, index) in disciplines"
          :key="index"
        >
        {{ item }};
        </li>
      </ul>
    </div>
  </div>
</template>

<script setup>
const text = "Привет, меня зовут Анна! С 2008 года являюсь преподавателем информационных технологий областного государственного бюджетного профессионального образовательного учреждения Томского экономико-промышленного колледжа, а также экспертом по компетенции «Автоматизация бизнес-процессов организаций»:<br>- с правом проведения чемпионатов по стандартам WorldSkills в рамках своего региона;<br>- с правом оценки демонстрационного экзамена по стандартам WorldSkills Russia;<br>- конкурсов по профессиональному мастерству «Абилимпикс».<br>Имею опыт программирования в 1С, Visual Studio, MySQL, phpMyAdmin, работала с различными системами учета, взаимодействовала с контролирующими и проверяющими органами. Владею такими программами как: 1С, ДОМИНО, Photoshop, Компас -3D, Blender и пр.<br>Отличаюсь внимательным и ответственным подходом к делу. Люблю обучать и обучаться. Отличительная черта моего характера заключается в том, что я максимально открыта и с огромной радостью делюсь не только программными знаниями, но и личными секретами профессионального мастерства, тонкостями профессии. Среди своих студентов мечтаю видеть целеустремленных и энергичных людей с чувством юмора и острым умом. Если это про вас — мы точно поладим и сможем извлечь максимальную пользу из совместных занятий."

const edu = 'Базовое образование: Томский государственный университет;'
const disciplines = [
  'Основы алгоритмизации и программирования', 
  'МДК.01.03 Разработка мобильных приложений',
  'МДК.01.04 Системное программирование',
  'УП.11 по ПМ.11',
  'МДК.11.01 Технология разработки и защиты баз данных',
  'УП.01 по ПМ.01',
  'МДК.01.01 Разработка программных модулей',
  'МДК.01.02 Поддержка и тестирование программных модулей',
  'МДК.13.03 Проектирование и разработка кода информационных систем',
  'Основы проектирования баз данных'
]
</script>

<style scoped lang="scss">
.container {
  display: flex;
  margin: 100px;
  height: calc(100vh - 120px);
  gap: 30px;
}

.picture {
  border-radius: 10px;
}

.text-content {
  background-color: white;
  border-radius: 10px;
  box-shadow: 0px 0px 6px rgba(61, 61, 61, 0.5);
  padding: 15px;
}

hr {
  border-color: $primary;
}

li {
  margin-left: 15px;
}
</style>